trol73/avr-make/asm/include/ATxmega128B1def.inc
.equ PORTM_DIR = 1888		// I/O Port Data Direction
.equ PORTM_DIRSET = 1889		// I/O Port Data Direction Set
.equ PORTM_DIRCLR = 1890		// I/O Port Data Direction Clear
.equ PORTM_DIRTGL = 1891		// I/O Port Data Direction Toggle
.equ PORTM_OUT = 1892		// I/O Port Output
.equ PORTM_OUTSET = 1893		// I/O Port Output Set
.equ PORTM_OUTCLR = 1894		// I/O Port Output Clear
.equ PORTM_OUTTGL = 1895		// I/O Port Output Toggle
.equ PORTM_IN = 1896		// I/O port Input
.equ PORTM_INTCTRL = 1897		// Interrupt Control Register
.equ PORTM_INT0MASK = 1898		// Port Interrupt 0 Mask
.equ PORTM_INT1MASK = 1899		// Port Interrupt 1 Mask
.equ PORTM_INTFLAGS = 1900		// Interrupt Flag Register
.equ PORTM_REMAP = 1902		// I/O Port Pin Remap Register
.equ PORTM_PIN0CTRL = 1904		// Pin 0 Control Register
.equ PORTM_PIN1CTRL = 1905		// Pin 1 Control Register
.equ PORTM_PIN2CTRL = 1906		// Pin 2 Control Register
.equ PORTM_PIN3CTRL = 1907		// Pin 3 Control Register
.equ PORTM_PIN4CTRL = 1908		// Pin 4 Control Register
.equ PORTM_PIN5CTRL = 1909		// Pin 5 Control Register
.equ PORTM_PIN6CTRL = 1910		// Pin 6 Control Register
.equ PORTM_PIN7CTRL = 1911		// Pin 7 Control Register

;***************************************************************************
;** PORTR - I/O Port R
;***************************************************************************
	
.equ PORTR_DIR = 2016		// I/O Port Data Direction
.equ PORTR_DIRSET = 2017		// I/O Port Data Direction Set
.equ PORTR_DIRCLR = 2018		// I/O Port Data Direction Clear
.equ PORTR_DIRTGL = 2019		// I/O Port Data Direction Toggle
.equ PORTR_OUT = 2020		// I/O Port Output
.equ PORTR_OUTSET = 2021		// I/O Port Output Set
.equ PORTR_OUTCLR = 2022		// I/O Port Output Clear
.equ PORTR_OUTTGL = 2023		// I/O Port Output Toggle
.equ PORTR_IN = 2024		// I/O port Input
.equ PORTR_INTCTRL = 2025		// Interrupt Control Register
.equ PORTR_INT0MASK = 2026		// Port Interrupt 0 Mask
.equ PORTR_INT1MASK = 2027		// Port Interrupt 1 Mask
.equ PORTR_INTFLAGS = 2028		// Interrupt Flag Register
.equ PORTR_REMAP = 2030		// I/O Port Pin Remap Register
.equ PORTR_PIN0CTRL = 2032		// Pin 0 Control Register
.equ PORTR_PIN1CTRL = 2033		// Pin 1 Control Register
.equ PORTR_PIN2CTRL = 2034		// Pin 2 Control Register
.equ PORTR_PIN3CTRL = 2035		// Pin 3 Control Register
.equ PORTR_PIN4CTRL = 2036		// Pin 4 Control Register
.equ PORTR_PIN5CTRL = 2037		// Pin 5 Control Register
.equ PORTR_PIN6CTRL = 2038		// Pin 6 Control Register
.equ PORTR_PIN7CTRL = 2039		// Pin 7 Control Register

;***************************************************************************
;** TCC0 - Timer/Counter C0
;***************************************************************************
	
.equ TCC0_CTRLA = 2048		// Control  Register A
.equ TCC0_CTRLB = 2049		// Control Register B
.equ TCC0_CTRLC = 2050		// Control register C
.equ TCC0_CTRLD = 2051		// Control Register D
.equ TCC0_CTRLE = 2052		// Control Register E
.equ TCC0_INTCTRLA = 2054		// Interrupt Control Register A
.equ TCC0_INTCTRLB = 2055		// Interrupt Control Register B
.equ TCC0_CTRLFCLR = 2056		// Control Register F Clear
.equ TCC0_CTRLFSET = 2057		// Control Register F Set
.equ TCC0_CTRLGCLR = 2058		// Control Register G Clear
.equ TCC0_CTRLGSET = 2059		// Control Register G Set
.equ TCC0_INTFLAGS = 2060		// Interrupt Flag Register
.equ TCC0_TEMP = 2063		// Temporary Register For 16-bit Access
.equ TCC0_CNT = 2080		// Count
.equ TCC0_PER = 2086		// Period
.equ TCC0_CCA = 2088		// Compare or Capture A
.equ TCC0_CCB = 2090		// Compare or Capture B
.equ TCC0_CCC = 2092		// Compare or Capture C
.equ TCC0_CCD = 2094		// Compare or Capture D
.equ TCC0_PERBUF = 2102		// Period Buffer
.equ TCC0_CCABUF = 2104		// Compare Or Capture A Buffer
.equ TCC0_CCBBUF = 2106		// Compare Or Capture B Buffer
.equ TCC0_CCCBUF = 2108		// Compare Or Capture C Buffer
.equ TCC0_CCDBUF = 2110		// Compare Or Capture D Buffer

;***************************************************************************
;** TCC2 - Timer/Counter C2
;***************************************************************************
	
.equ TCC2_CTRLA = 2048		// Control Register A
.equ TCC2_CTRLB = 2049		// Control Register B
.equ TCC2_CTRLC = 2050		// Control register C
.equ TCC2_CTRLE = 2052		// Control Register E
.equ TCC2_INTCTRLA = 2054		// Interrupt Control Register A
.equ TCC2_INTCTRLB = 2055		// Interrupt Control Register B
.equ TCC2_CTRLF = 2057		// Control Register F
.equ TCC2_INTFLAGS = 2060		// Interrupt Flag Register
.equ TCC2_LCNT = 2080		// Low Byte Count
.equ TCC2_HCNT = 2081		// High Byte Count
.equ TCC2_LPER = 2086		// Low Byte Period
.equ TCC2_HPER = 2087		// High Byte Period
.equ TCC2_LCMPA = 2088		// Low Byte Compare A
.equ TCC2_HCMPA = 2089		// High Byte Compare A
.equ TCC2_LCMPB = 2090		// Low Byte Compare B
.equ TCC2_HCMPB = 2091		// High Byte Compare B
.equ TCC2_LCMPC = 2092		// Low Byte Compare C
.equ TCC2_HCMPC = 2093		// High Byte Compare C
.equ TCC2_LCMPD = 2094		// Low Byte Compare D
.equ TCC2_HCMPD = 2095		// High Byte Compare D

;***************************************************************************
;** TCC1 - Timer/Counter C1
;***************************************************************************
	
.equ TCC1_CTRLA = 2112		// Control  Register A
.equ TCC1_CTRLB = 2113		// Control Register B
.equ TCC1_CTRLC = 2114		// Control register C
.equ TCC1_CTRLD = 2115		// Control Register D
.equ TCC1_CTRLE = 2116		// Control Register E
.equ TCC1_INTCTRLA = 2118		// Interrupt Control Register A
.equ TCC1_INTCTRLB = 2119		// Interrupt Control Register B
.equ TCC1_CTRLFCLR = 2120		// Control Register F Clear
.equ TCC1_CTRLFSET = 2121		// Control Register F Set
.equ TCC1_CTRLGCLR = 2122		// Control Register G Clear
.equ TCC1_CTRLGSET = 2123		// Control Register G Set
.equ TCC1_INTFLAGS = 2124		// Interrupt Flag Register
.equ TCC1_TEMP = 2127		// Temporary Register For 16-bit Access
.equ TCC1_CNT = 2144		// Count
.equ TCC1_PER = 2150		// Period
.equ TCC1_CCA = 2152		// Compare or Capture A
.equ TCC1_CCB = 2154		// Compare or Capture B
.equ TCC1_PERBUF = 2166		// Period Buffer
.equ TCC1_CCABUF = 2168		// Compare Or Capture A Buffer
.equ TCC1_CCBBUF = 2170		// Compare Or Capture B Buffer

;***************************************************************************
;** AWEXC - Advanced Waveform Extension C
;***************************************************************************
	
