trol73/avr-make/asm/include/ATxmega128B1def.inc
.equ AWEXC_CTRL = 2176		// Control Register
.equ AWEXC_FDEMASK = 2178		// Fault Detection Event Mask
.equ AWEXC_FDCTRL = 2179		// Fault Detection Control Register
.equ AWEXC_STATUS = 2180		// Status Register
.equ AWEXC_STATUSSET = 2181		// Status Set Register
.equ AWEXC_DTBOTH = 2182		// Dead Time Both Sides
.equ AWEXC_DTBOTHBUF = 2183		// Dead Time Both Sides Buffer
.equ AWEXC_DTLS = 2184		// Dead Time Low Side
.equ AWEXC_DTHS = 2185		// Dead Time High Side
.equ AWEXC_DTLSBUF = 2186		// Dead Time Low Side Buffer
.equ AWEXC_DTHSBUF = 2187		// Dead Time High Side Buffer
.equ AWEXC_OUTOVEN = 2188		// Output Override Enable

;***************************************************************************
;** HIRESC - High-Resolution Extension C
;***************************************************************************
	
.equ HIRESC_CTRLA = 2192		// Control Register

;***************************************************************************
;** USARTC0 - Universal Asynchronous Receiver-Transmitter C0
;***************************************************************************
	
.equ USARTC0_DATA = 2208		// Data Register
.equ USARTC0_STATUS = 2209		// Status Register
.equ USARTC0_CTRLA = 2211		// Control Register A
.equ USARTC0_CTRLB = 2212		// Control Register B
.equ USARTC0_CTRLC = 2213		// Control Register C
.equ USARTC0_BAUDCTRLA = 2214		// Baud Rate Control Register A
.equ USARTC0_BAUDCTRLB = 2215		// Baud Rate Control Register B

;***************************************************************************
;** SPIC - Serial Peripheral Interface C
;***************************************************************************
	
.equ SPIC_CTRL = 2240		// Control Register
.equ SPIC_INTCTRL = 2241		// Interrupt Control Register
.equ SPIC_STATUS = 2242		// Status Register
.equ SPIC_DATA = 2243		// Data Register

;***************************************************************************
;** IRCOM - IR Communication Module
;***************************************************************************
	
.equ IRCOM_CTRL = 2296		// Control Register
.equ IRCOM_TXPLCTRL = 2297		// IrDA Transmitter Pulse Length Control Register
.equ IRCOM_RXPLCTRL = 2298		// IrDA Receiver Pulse Length Control Register

;***************************************************************************
;** TCE0 - Timer/Counter E0
;***************************************************************************
	
.equ TCE0_CTRLA = 2560		// Control  Register A
.equ TCE0_CTRLB = 2561		// Control Register B
.equ TCE0_CTRLC = 2562		// Control register C
.equ TCE0_CTRLD = 2563		// Control Register D
.equ TCE0_CTRLE = 2564		// Control Register E
.equ TCE0_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE0_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE0_CTRLFCLR = 2568		// Control Register F Clear
.equ TCE0_CTRLFSET = 2569		// Control Register F Set
.equ TCE0_CTRLGCLR = 2570		// Control Register G Clear
.equ TCE0_CTRLGSET = 2571		// Control Register G Set
.equ TCE0_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE0_TEMP = 2575		// Temporary Register For 16-bit Access
.equ TCE0_CNT = 2592		// Count
.equ TCE0_PER = 2598		// Period
.equ TCE0_CCA = 2600		// Compare or Capture A
.equ TCE0_CCB = 2602		// Compare or Capture B
.equ TCE0_CCC = 2604		// Compare or Capture C
.equ TCE0_CCD = 2606		// Compare or Capture D
.equ TCE0_PERBUF = 2614		// Period Buffer
.equ TCE0_CCABUF = 2616		// Compare Or Capture A Buffer
.equ TCE0_CCBBUF = 2618		// Compare Or Capture B Buffer
.equ TCE0_CCCBUF = 2620		// Compare Or Capture C Buffer
.equ TCE0_CCDBUF = 2622		// Compare Or Capture D Buffer

;***************************************************************************
;** TCE2 - Timer/Counter E2
;***************************************************************************
	
.equ TCE2_CTRLA = 2560		// Control Register A
.equ TCE2_CTRLB = 2561		// Control Register B
.equ TCE2_CTRLC = 2562		// Control register C
.equ TCE2_CTRLE = 2564		// Control Register E
.equ TCE2_INTCTRLA = 2566		// Interrupt Control Register A
.equ TCE2_INTCTRLB = 2567		// Interrupt Control Register B
.equ TCE2_CTRLF = 2569		// Control Register F
.equ TCE2_INTFLAGS = 2572		// Interrupt Flag Register
.equ TCE2_LCNT = 2592		// Low Byte Count
.equ TCE2_HCNT = 2593		// High Byte Count
.equ TCE2_LPER = 2598		// Low Byte Period
.equ TCE2_HPER = 2599		// High Byte Period
.equ TCE2_LCMPA = 2600		// Low Byte Compare A
.equ TCE2_HCMPA = 2601		// High Byte Compare A
.equ TCE2_LCMPB = 2602		// Low Byte Compare B
.equ TCE2_HCMPB = 2603		// High Byte Compare B
.equ TCE2_LCMPC = 2604		// Low Byte Compare C
.equ TCE2_HCMPC = 2605		// High Byte Compare C
.equ TCE2_LCMPD = 2606		// Low Byte Compare D
.equ TCE2_HCMPD = 2607		// High Byte Compare D

;***************************************************************************
;** USARTE0 - Universal Asynchronous Receiver-Transmitter E0
;***************************************************************************
	
.equ USARTE0_DATA = 2720		// Data Register
.equ USARTE0_STATUS = 2721		// Status Register
.equ USARTE0_CTRLA = 2723		// Control Register A
.equ USARTE0_CTRLB = 2724		// Control Register B
.equ USARTE0_CTRLC = 2725		// Control Register C
.equ USARTE0_BAUDCTRLA = 2726		// Baud Rate Control Register A
.equ USARTE0_BAUDCTRLB = 2727		// Baud Rate Control Register B

;***************************************************************************
;** LCD - LCD Controller 
;***************************************************************************
	
.equ LCD_CTRLA = 3328		// Control Register A
.equ LCD_CTRLB = 3329		// Control Register B
.equ LCD_CTRLC = 3330		// Control Register C
.equ LCD_INTCTRL = 3331		// Interrupt Enable Register
.equ LCD_INTFLAG = 3332		// Interrupt Flag Register
.equ LCD_CTRLD = 3333		// Control Register D
.equ LCD_CTRLE = 3334		// Control Register E
.equ LCD_CTRLF = 3335		// Control Register F
.equ LCD_CTRLG = 3336		// Control Register G
.equ LCD_CTRLH = 3337		// Control Register H
.equ LCD_DATA0 = 3344		// LCD Data Register 0
.equ LCD_DATA1 = 3345		// LCD Data Register 1
.equ LCD_DATA2 = 3346		// LCD Data Register 2
.equ LCD_DATA3 = 3347		// LCD Data Register 3
.equ LCD_DATA4 = 3348		// LCD Data Register 4
.equ LCD_DATA5 = 3349		// LCD Data Register 5
.equ LCD_DATA6 = 3350		// LCD Data Register 6
.equ LCD_DATA7 = 3351		// LCD Data Register 7
.equ LCD_DATA8 = 3352		// LCD Data Register 8
.equ LCD_DATA9 = 3353		// LCD Data Register 9
.equ LCD_DATA10 = 3354		// LCD Data Register 10
.equ LCD_DATA11 = 3355		// LCD Data Register 11
.equ LCD_DATA12 = 3356		// LCD Data Register 12
.equ LCD_DATA13 = 3357		// LCD Data Register 13
.equ LCD_DATA14 = 3358		// LCD Data Register 14
.equ LCD_DATA15 = 3359		// LCD Data Register 15
.equ LCD_DATA16 = 3360		// LCD Data Register 16
.equ LCD_DATA17 = 3361		// LCD Data Register 17
.equ LCD_DATA18 = 3362		// LCD Data Register 18
.equ LCD_DATA19 = 3363		// LCD Data Register 19


; ***** ALL MODULE BASE ADRESSES *****************************************

.equ GPIO_base = 0x0000		// General Purpose IO Registers
.equ VPORT0_base = 0x0010		// Virtual Port 0
.equ VPORT1_base = 0x0014		// Virtual Port 1
.equ VPORT2_base = 0x0018		// Virtual Port 2
.equ VPORT3_base = 0x001C		// Virtual Port 3
.equ OCD_base = 0x002E		// On-Chip Debug System
.equ CPU_base = 0x0030		// CPU Registers
.equ CLK_base = 0x0040		// Clock System
.equ SLEEP_base = 0x0048		// Sleep Controller
.equ OSC_base = 0x0050		// Oscillator Control
.equ DFLLRC32M_base = 0x0060		// DFLL for 32MHz RC Oscillator
.equ DFLLRC2M_base = 0x0068		// DFLL for 2MHz RC Oscillator
.equ PR_base = 0x0070		// Power Reduction
.equ RST_base = 0x0078		// Reset Controller
.equ WDT_base = 0x0080		// Watch-Dog Timer
.equ MCU_base = 0x0090		// MCU Control
.equ PMIC_base = 0x00A0		// Programmable Interrupt Controller
.equ PORTCFG_base = 0x00B0		// Port Configuration
.equ AES_base = 0x0C0		// AES Crypto Module
.equ CRC_base = 0x0D0		// CRC Module
.equ DMA_base = 0x0100		// DMA Controller
.equ EVSYS_base = 0x0180		// Event System
.equ NVM_base = 0x01C0		// Non Volatile Memory Controller
.equ ADCA_base = 0x0200		// Analog to Digital Converter A
.equ ADCB_base = 0x0240		// Analog to Digital Converter B
.equ ACA_base = 0x0380		// Analog Comparator A
.equ ACB_base = 0x0390		// Analog Comparator B
.equ RTC_base = 0x0400		// Real-Time Counter
.equ TWIC_base = 0x480		// Two-Wire Interface C
.equ USB_base = 0x4C0		// Universal Serial Bus Module
.equ PORTA_base = 0x0600		// I/O Port A
.equ PORTB_base = 0x0620		// I/O Port B
.equ PORTC_base = 0x0640		// I/O Port C
.equ PORTD_base = 0x0660		// I/O Port D
.equ PORTE_base = 0x0680		// I/O Port E
.equ PORTG_base = 0x06C0		// I/O Port G
.equ PORTM_base = 0x0760		// I/O Port M
.equ PORTR_base = 0x07E0		// I/O Port R
.equ TCC0_base = 0x800		// Timer/Counter C0
.equ TCC2_base = 0x800		// Timer/Counter C2
.equ TCC1_base = 0x840		// Timer/Counter C1
.equ AWEXC_base = 0x880		// Advanced Waveform Extension C
.equ HIRESC_base = 0x890		// High-Resolution Extension C
.equ USARTC0_base = 0x8A0		// Universal Asynchronous Receiver-Transmitter C0
.equ SPIC_base = 0x8C0		// Serial Peripheral Interface C
.equ IRCOM_base = 0x8F8		// IR Communication Module
.equ TCE0_base = 0xA00		// Timer/Counter E0
.equ TCE2_base = 0xA00		// Timer/Counter E2
.equ USARTE0_base = 0xAA0		// Universal Asynchronous Receiver-Transmitter E0
.equ LCD_base = 0x0D00		// LCD Controller 


