trol73/avr-make/asm/include/ATxmega128B1def.inc
; Character Size
.equ USART_CHSIZE_5BIT_gc = (0x00<<0) ; Character size: 5 bit
.equ USART_CHSIZE_6BIT_gc = (0x01<<0) ; Character size: 6 bit
.equ USART_CHSIZE_7BIT_gc = (0x02<<0) ; Character size: 7 bit
.equ USART_CHSIZE_8BIT_gc = (0x03<<0) ; Character size: 8 bit
.equ USART_CHSIZE_9BIT_gc = (0x07<<0) ; Character size: 9 bit

; Communication Mode
.equ USART_CMODE_ASYNCHRONOUS_gc = (0x00<<6) ; Asynchronous Mode
.equ USART_CMODE_SYNCHRONOUS_gc = (0x01<<6) ; Synchronous Mode
.equ USART_CMODE_IRDA_gc = (0x02<<6) ; IrDA Mode
.equ USART_CMODE_MSPI_gc = (0x03<<6) ; Master SPI Mode

; Parity Mode
.equ USART_PMODE_DISABLED_gc = (0x00<<4) ; No Parity
.equ USART_PMODE_EVEN_gc = (0x02<<4) ; Even Parity
.equ USART_PMODE_ODD_gc = (0x03<<4) ; Odd Parity


;***************************************************************************
;** SPI - Serial Peripheral Interface
;***************************************************************************/

; SPI_CTRL masks
.equ SPI_CLK2X_bm = 0x80 ; Enable Double Speed bit mask
.equ SPI_CLK2X_bp = 7 ; Enable Double Speed bit position
.equ SPI_ENABLE_bm = 0x40 ; Enable Module bit mask
.equ SPI_ENABLE_bp = 6 ; Enable Module bit position
.equ SPI_DORD_bm = 0x20 ; Data Order Setting bit mask
.equ SPI_DORD_bp = 5 ; Data Order Setting bit position
.equ SPI_MASTER_bm = 0x10 ; Master Operation Enable bit mask
.equ SPI_MASTER_bp = 4 ; Master Operation Enable bit position
.equ SPI_MODE_gm = 0x0C ; SPI Mode group mask
.equ SPI_MODE_gp = 2 ; SPI Mode group position
.equ SPI_MODE0_bm = (1<<2) ; SPI Mode bit 0 mask
.equ SPI_MODE0_bp = 2 ; SPI Mode bit 0 position
.equ SPI_MODE1_bm = (1<<3) ; SPI Mode bit 1 mask
.equ SPI_MODE1_bp = 3 ; SPI Mode bit 1 position
.equ SPI_PRESCALER_gm = 0x03 ; Prescaler group mask
.equ SPI_PRESCALER_gp = 0 ; Prescaler group position
.equ SPI_PRESCALER0_bm = (1<<0) ; Prescaler bit 0 mask
.equ SPI_PRESCALER0_bp = 0 ; Prescaler bit 0 position
.equ SPI_PRESCALER1_bm = (1<<1) ; Prescaler bit 1 mask
.equ SPI_PRESCALER1_bp = 1 ; Prescaler bit 1 position

; SPI_INTCTRL masks
.equ SPI_INTLVL_gm = 0x03 ; Interrupt level group mask
.equ SPI_INTLVL_gp = 0 ; Interrupt level group position
.equ SPI_INTLVL0_bm = (1<<0) ; Interrupt level bit 0 mask
.equ SPI_INTLVL0_bp = 0 ; Interrupt level bit 0 position
.equ SPI_INTLVL1_bm = (1<<1) ; Interrupt level bit 1 mask
.equ SPI_INTLVL1_bp = 1 ; Interrupt level bit 1 position

; SPI_STATUS masks
.equ SPI_IF_bm = 0x80 ; Interrupt Flag bit mask
.equ SPI_IF_bp = 7 ; Interrupt Flag bit position
.equ SPI_WRCOL_bm = 0x40 ; Write Collision bit mask
.equ SPI_WRCOL_bp = 6 ; Write Collision bit position
 
; SPI Mode
.equ SPI_MODE_0_gc = (0x00<<2) ; SPI Mode 0
.equ SPI_MODE_1_gc = (0x01<<2) ; SPI Mode 1
.equ SPI_MODE_2_gc = (0x02<<2) ; SPI Mode 2
.equ SPI_MODE_3_gc = (0x03<<2) ; SPI Mode 3

; Prescaler setting
.equ SPI_PRESCALER_DIV4_gc = (0x00<<0) ; System Clock / 4
.equ SPI_PRESCALER_DIV16_gc = (0x01<<0) ; System Clock / 16
.equ SPI_PRESCALER_DIV64_gc = (0x02<<0) ; System Clock / 64
.equ SPI_PRESCALER_DIV128_gc = (0x03<<0) ; System Clock / 128

; Interrupt level
.equ SPI_INTLVL_OFF_gc = (0x00<<0) ; Interrupt Disabled
.equ SPI_INTLVL_LO_gc = (0x01<<0) ; Low Level
.equ SPI_INTLVL_MED_gc = (0x02<<0) ; Medium Level
.equ SPI_INTLVL_HI_gc = (0x03<<0) ; High Level


;***************************************************************************
;** IRCOM - IR Communication Module
;***************************************************************************/

; IRCOM_CTRL masks
.equ IRCOM_EVSEL_gm = 0x0F ; Event Channel Select group mask
.equ IRCOM_EVSEL_gp = 0 ; Event Channel Select group position
.equ IRCOM_EVSEL0_bm = (1<<0) ; Event Channel Select bit 0 mask
.equ IRCOM_EVSEL0_bp = 0 ; Event Channel Select bit 0 position
.equ IRCOM_EVSEL1_bm = (1<<1) ; Event Channel Select bit 1 mask
.equ IRCOM_EVSEL1_bp = 1 ; Event Channel Select bit 1 position
.equ IRCOM_EVSEL2_bm = (1<<2) ; Event Channel Select bit 2 mask
.equ IRCOM_EVSEL2_bp = 2 ; Event Channel Select bit 2 position
.equ IRCOM_EVSEL3_bm = (1<<3) ; Event Channel Select bit 3 mask
.equ IRCOM_EVSEL3_bp = 3 ; Event Channel Select bit 3 position
 
; Event channel selection
.equ IRDA_EVSEL_OFF_gc = (0x00<<0) ; No Event Source
.equ IRDA_EVSEL_0_gc = (0x08<<0) ; Event Channel 0
.equ IRDA_EVSEL_1_gc = (0x09<<0) ; Event Channel 1
.equ IRDA_EVSEL_2_gc = (0x0A<<0) ; Event Channel 2
.equ IRDA_EVSEL_3_gc = (0x0B<<0) ; Event Channel 3


;***************************************************************************
;** LCD - LCD Controller
;***************************************************************************/

; LCD_CTRLA masks
.equ LCD_ENABLE_bm = 0x80 ; LCD Enable bit mask
.equ LCD_ENABLE_bp = 7 ; LCD Enable bit position
.equ LCD_XBIAS_bm = 0x40 ; External Register Bias Generation bit mask
.equ LCD_XBIAS_bp = 6 ; External Register Bias Generation bit position
.equ LCD_DATCLK_bm = 0x20 ; Data Register Lock bit mask
.equ LCD_DATCLK_bp = 5 ; Data Register Lock bit position
.equ LCD_COMSWP_bm = 0x10 ; Common Bus Swap bit mask
.equ LCD_COMSWP_bp = 4 ; Common Bus Swap bit position
.equ LCD_SEGSWP_bm = 0x08 ; Segment Bus Swap bit mask
.equ LCD_SEGSWP_bp = 3 ; Segment Bus Swap bit position
.equ LCD_CLRDT_bm = 0x04 ; Clear Data Register bit mask
.equ LCD_CLRDT_bp = 2 ; Clear Data Register bit position
.equ LCD_SEGON_bm = 0x02 ; Segments On bit mask
.equ LCD_SEGON_bp = 1 ; Segments On bit position
.equ LCD_BLANK_bm = 0x01 ; Blanking Display Mode bit mask
.equ LCD_BLANK_bp = 0 ; Blanking Display Mode bit position

; LCD_CTRLB masks
.equ LCD_PRESC_bm = 0x80 ; LCD Prescaler Select bit mask
.equ LCD_PRESC_bp = 7 ; LCD Prescaler Select bit position
.equ LCD_CLKDIV_gm = 0x70 ; LCD Clock Divide group mask
.equ LCD_CLKDIV_gp = 4 ; LCD Clock Divide group position
.equ LCD_CLKDIV0_bm = (1<<4) ; LCD Clock Divide bit 0 mask
.equ LCD_CLKDIV0_bp = 4 ; LCD Clock Divide bit 0 position
.equ LCD_CLKDIV1_bm = (1<<5) ; LCD Clock Divide bit 1 mask
.equ LCD_CLKDIV1_bp = 5 ; LCD Clock Divide bit 1 position
.equ LCD_CLKDIV2_bm = (1<<6) ; LCD Clock Divide bit 2 mask
.equ LCD_CLKDIV2_bp = 6 ; LCD Clock Divide bit 2 position
.equ LCD_LPWAV_bm = 0x08 ; Low Power Waveform bit mask
.equ LCD_LPWAV_bp = 3 ; Low Power Waveform bit position
.equ LCD_DUTY_gm = 0x03 ; Duty Select group mask
.equ LCD_DUTY_gp = 0 ; Duty Select group position
.equ LCD_DUTY0_bm = (1<<0) ; Duty Select bit 0 mask
.equ LCD_DUTY0_bp = 0 ; Duty Select bit 0 position
.equ LCD_DUTY1_bm = (1<<1) ; Duty Select bit 1 mask
.equ LCD_DUTY1_bp = 1 ; Duty Select bit 1 position

; LCD_CTRLC masks
.equ LCD_PMSK_gm = 0x3F ; LCD Port Mask group mask
.equ LCD_PMSK_gp = 0 ; LCD Port Mask group position
.equ LCD_PMSK0_bm = (1<<0) ; LCD Port Mask bit 0 mask
.equ LCD_PMSK0_bp = 0 ; LCD Port Mask bit 0 position
.equ LCD_PMSK1_bm = (1<<1) ; LCD Port Mask bit 1 mask
.equ LCD_PMSK1_bp = 1 ; LCD Port Mask bit 1 position
.equ LCD_PMSK2_bm = (1<<2) ; LCD Port Mask bit 2 mask
.equ LCD_PMSK2_bp = 2 ; LCD Port Mask bit 2 position
.equ LCD_PMSK3_bm = (1<<3) ; LCD Port Mask bit 3 mask
.equ LCD_PMSK3_bp = 3 ; LCD Port Mask bit 3 position
.equ LCD_PMSK4_bm = (1<<4) ; LCD Port Mask bit 4 mask
.equ LCD_PMSK4_bp = 4 ; LCD Port Mask bit 4 position
.equ LCD_PMSK5_bm = (1<<5) ; LCD Port Mask bit 5 mask
.equ LCD_PMSK5_bp = 5 ; LCD Port Mask bit 5 position

; LCD_INTCTRL masks
.equ LCD_XIME_gm = 0xF8 ; eXtended Interrupt Mode Enable group mask
.equ LCD_XIME_gp = 3 ; eXtended Interrupt Mode Enable group position
.equ LCD_XIME0_bm = (1<<3) ; eXtended Interrupt Mode Enable bit 0 mask
.equ LCD_XIME0_bp = 3 ; eXtended Interrupt Mode Enable bit 0 position
.equ LCD_XIME1_bm = (1<<4) ; eXtended Interrupt Mode Enable bit 1 mask
.equ LCD_XIME1_bp = 4 ; eXtended Interrupt Mode Enable bit 1 position
.equ LCD_XIME2_bm = (1<<5) ; eXtended Interrupt Mode Enable bit 2 mask
.equ LCD_XIME2_bp = 5 ; eXtended Interrupt Mode Enable bit 2 position
.equ LCD_XIME3_bm = (1<<6) ; eXtended Interrupt Mode Enable bit 3 mask
.equ LCD_XIME3_bp = 6 ; eXtended Interrupt Mode Enable bit 3 position
.equ LCD_XIME4_bm = (1<<7) ; eXtended Interrupt Mode Enable bit 4 mask
.equ LCD_XIME4_bp = 7 ; eXtended Interrupt Mode Enable bit 4 position
.equ LCD_FCINTLVL_gm = 0x03 ; Interrupt Level group mask
.equ LCD_FCINTLVL_gp = 0 ; Interrupt Level group position
.equ LCD_FCINTLVL0_bm = (1<<0) ; Interrupt Level bit 0 mask
.equ LCD_FCINTLVL0_bp = 0 ; Interrupt Level bit 0 position
.equ LCD_FCINTLVL1_bm = (1<<1) ; Interrupt Level bit 1 mask
.equ LCD_FCINTLVL1_bp = 1 ; Interrupt Level bit 1 position

; LCD_INTFLAG masks
.equ LCD_FCIF_bm = 0x01 ; LCD Frame Completed Interrupt Flag bit mask
.equ LCD_FCIF_bp = 0 ; LCD Frame Completed Interrupt Flag bit position

; LCD_CTRLD masks
.equ LCD_BLINKEN_bm = 0x08 ; Blink Enable bit mask
.equ LCD_BLINKEN_bp = 3 ; Blink Enable bit position
.equ LCD_BLINKRATE_gm = 0x03 ; LCD Blink Rate group mask
.equ LCD_BLINKRATE_gp = 0 ; LCD Blink Rate group position
.equ LCD_BLINKRATE0_bm = (1<<0) ; LCD Blink Rate bit 0 mask
.equ LCD_BLINKRATE0_bp = 0 ; LCD Blink Rate bit 0 position
.equ LCD_BLINKRATE1_bm = (1<<1) ; LCD Blink Rate bit 1 mask
.equ LCD_BLINKRATE1_bp = 1 ; LCD Blink Rate bit 1 position

; LCD_CTRLE masks
.equ LCD_BPS1_gm = 0xF0 ; Blink Pixel Selection 1 group mask
.equ LCD_BPS1_gp = 4 ; Blink Pixel Selection 1 group position
.equ LCD_BPS10_bm = (1<<4) ; Blink Pixel Selection 1 bit 0 mask
.equ LCD_BPS10_bp = 4 ; Blink Pixel Selection 1 bit 0 position
.equ LCD_BPS11_bm = (1<<5) ; Blink Pixel Selection 1 bit 1 mask
.equ LCD_BPS11_bp = 5 ; Blink Pixel Selection 1 bit 1 position
.equ LCD_BPS12_bm = (1<<6) ; Blink Pixel Selection 1 bit 2 mask
.equ LCD_BPS12_bp = 6 ; Blink Pixel Selection 1 bit 2 position
.equ LCD_BPS13_bm = (1<<7) ; Blink Pixel Selection 1 bit 3 mask
.equ LCD_BPS13_bp = 7 ; Blink Pixel Selection 1 bit 3 position
.equ LCD_BPS0_gm = 0x0F ; Blink Pixel Selection 0 group mask
.equ LCD_BPS0_gp = 0 ; Blink Pixel Selection 0 group position
.equ LCD_BPS00_bm = (1<<0) ; Blink Pixel Selection 0 bit 0 mask
.equ LCD_BPS00_bp = 0 ; Blink Pixel Selection 0 bit 0 position
.equ LCD_BPS01_bm = (1<<1) ; Blink Pixel Selection 0 bit 1 mask
.equ LCD_BPS01_bp = 1 ; Blink Pixel Selection 0 bit 1 position
.equ LCD_BPS02_bm = (1<<2) ; Blink Pixel Selection 0 bit 2 mask
.equ LCD_BPS02_bp = 2 ; Blink Pixel Selection 0 bit 2 position
.equ LCD_BPS03_bm = (1<<3) ; Blink Pixel Selection 0 bit 3 mask
.equ LCD_BPS03_bp = 3 ; Blink Pixel Selection 0 bit 3 position

