trol73/avr-make/asm/include/ATxmega128B1def.inc
; ACA interrupt vectors
.equ ACA_AC0_vect = 154 ; AC0 Interrupt
.equ ACA_AC1_vect = 156 ; AC1 Interrupt
.equ ACA_ACW_vect = 158 ; ACW Window Mode Interrupt

; ADCA interrupt vectors
.equ ADCA_CH0_vect = 160 ; Interrupt 0



; ***** INTERRUPT VECTORS, MODULE BASES **********************************

.equ OSC_vbase = 2
.equ PORTC_vbase = 4
.equ PORTR_vbase = 8
.equ DMA_vbase = 12
.equ RTC_vbase = 20
.equ TWIC_vbase = 24
.equ TCC0_vbase = 28
.equ TCC2_vbase = 28
.equ TCC1_vbase = 40
.equ SPIC_vbase = 48
.equ USARTC0_vbase = 50
.equ USB_vbase = 62
.equ LCD_vbase = 70
.equ AES_vbase = 72
.equ NVM_vbase = 74
.equ PORTB_vbase = 78
.equ ACB_vbase = 82
.equ ADCB_vbase = 88
.equ PORTD_vbase = 96
.equ PORTG_vbase = 100
.equ PORTM_vbase = 104
.equ PORTE_vbase = 108
.equ TCE0_vbase = 116
.equ TCE2_vbase = 116
.equ USARTE0_vbase = 138
.equ PORTA_vbase = 150
.equ ACA_vbase = 154
.equ ADCA_vbase = 160


; ***** INTERRUPT VECTORS, VECTOR OFFSETS *********************************

; OSC interrupt vector offsets

.equ OSC_OSCF_voffset = 0

; AES interrupt vector offsets

.equ AES_INT_voffset = 0

; DMA interrupt vector offsets

.equ DMA_CH0_voffset = 0
.equ DMA_CH1_voffset = 2

; NVM interrupt vector offsets

.equ NVM_EE_voffset = 0
.equ NVM_SPM_voffset = 2

; ADC interrupt vector offsets

.equ ADC_CH0_voffset = 0

; AC interrupt vector offsets

.equ AC_AC0_voffset = 0
.equ AC_AC1_voffset = 2
.equ AC_ACW_voffset = 4

; RTC interrupt vector offsets

.equ RTC_OVF_voffset = 0
.equ RTC_COMP_voffset = 2

; TWI interrupt vector offsets

.equ TWI_TWIS_voffset = 0
.equ TWI_TWIM_voffset = 2

; USB interrupt vector offsets

.equ USB_BUSEVENT_voffset = 0
.equ USB_TRNCOMPL_voffset = 2

; PORT interrupt vector offsets

.equ PORT_INT0_voffset = 0
.equ PORT_INT1_voffset = 2

; TC0 interrupt vector offsets

.equ TC0_OVF_voffset = 0
.equ TC0_ERR_voffset = 2
.equ TC0_CCA_voffset = 4
.equ TC0_CCB_voffset = 6
.equ TC0_CCC_voffset = 8
.equ TC0_CCD_voffset = 10

; TC1 interrupt vector offsets

.equ TC1_OVF_voffset = 0
.equ TC1_ERR_voffset = 2
.equ TC1_CCA_voffset = 4
.equ TC1_CCB_voffset = 6

; TC2 interrupt vector offsets

.equ TC2_LUNF_voffset = 0
.equ TC2_HUNF_voffset = 2
.equ TC2_LCMPA_voffset = 4
.equ TC2_LCMPB_voffset = 6
.equ TC2_LCMPC_voffset = 8
.equ TC2_LCMPD_voffset = 10

; USART interrupt vector offsets

.equ USART_RXC_voffset = 0
.equ USART_DRE_voffset = 2
.equ USART_TXC_voffset = 4

; SPI interrupt vector offsets

.equ SPI_INT_voffset = 0

; LCD interrupt vector offsets

.equ LCD_INT_voffset = 0



.equ INT_VECTORS_SIZE = 162 ; size in words


#endif  /* _ATxmega128B1DEF_INC_ */

; ***** END OF FILE ******************************************************



